DirectMarket/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("category", "created_at", "description", "name", "picture", "subcategory", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = 1