DirectMarket/app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @markets = Market.all