app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.save
---
INSERT INTO "users" ("created_at", "email", "firstname", "lastname", "password", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)